---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle
source: html/977c3aa9-0676-c93b-1546-c0db2d96c564.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle

Defines parameters for L-angle Flange structural section.

## Syntax (C#)
```csharp
public class StructuralSectionLAngle : StructuralSectionGeneralW
```